tutorials/reactiveTransport/dissolTransportDyMFoam/3DcalcitePost/system/controlDictRun
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     dissolTransportDyMFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         var;

deltaT          18;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

checkFrequency 1;

libs (
"libfvMotionSolverGCFOAM.so"
"libmeshToolsGCFOAM.so"
);



OptimisationSwitches
{
    commsType       blocking;
}

// ************************************************************************* //
