tutorials/reactiveTransport/dissolTransportDyMFoam/3DcalcitePost/0_org/Surf
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Surf;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -2 0 0 1 0 0];

internalField   uniform 0;

boundaryField
{
    movingWalls
    {
        type            zeroGradient;
    }

    right
    {
        type            zeroGradient;
    }

    left
    {
        type            fixedValue;
        value           uniform 10;
    }

    top
    {
        type            zeroGradient;
    }

    bottom
    {
       type zeroGradient;
    }

    frontAndBack
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
